"""
Напишите программу принимающую ввод информации о треке(место в чарте,исполнитель, название) пока пользователь
не введет "off". Программа должна вывести всю информацию в виде словаря вида: {(место,испонитель): название трека}
"""
inf = {}

while True:
    a = input("Введите место в чарте,исполнитель, название, через пробел: ").split()
    if a[0] == 'off':
        break
    inf[f'{a[0]}, {a[1]}'] = a[0]


print(inf)