"""
Напишите программу определяющую допуск ученика к зачету.
Программа должна запрашивать число учеников, затем у каждого ученика запрашивать балл за финальный тест
и в ответ печатать, допущен ли он (True или False) к зачету (необходимо набрать больше 50 баллов).

Ученикам без допуска должно печататься "Вы отчислены".

Выдачу допуска реализуй как функцию.
"""


def student(quantity: int):
    if quantity <= 0:
        return
    print(f"Sudent№ {quantity}")
    points = int(input("Print mark: "))
    if points > 50:
        print("True-Вы сдали")
    else:
        print("Вы отчислены. Собирайте вещи")
    quantity -= 1
    student(quantity)


student(3)
