"""
Каждый стажёр мог выбрать любое число предметов для изучения. По каждому предмету он мог набрать от 0 до 50 баллов.

Программа должна:
Пока пользователь не введет "стоп":
1. Запрашивать имя студента и число предметов.
2. Запрашивать число баллов по каждому предмету и печатать общую сумму баллов: «Итоговый счёт: _».
3. По сумме баллов опеределять тип грамоты о прохождении стажировки:
- баллов больше 80 — «Наградить дипломом.»;
- баллов больше 50 и меньше или равно 80 — «Наградить похвальной грамотой.»;
- остальные случаи — «Выдать грамоту об участии.».
"""

def сount_and_return_sumpoints(items:int):
    result = 0
    for i in range(1,items + 1):
        print(f"Предмет №{i}")
        point = int(input("Количество боллов: "))
        result += point
    return result

def check_result(result:int):
    if result > 80:
        print("Наградить дипломом.")
    elif 50 < result <= 80:
        print("Наградить похвальной грамотой.")
    else:
        print("Выдать грамоту об участии.")

name = input("Type name or off: ")
while name != "off":
    number_item = int(input("Количество предметов: "))
    result = сount_and_return_sumpoints(number_item)
    print(f"Итоговый счёт: {result}")
    check_result(result)
    name = input("Type name or off: ")
